<template>
  <div>
    <!--  Универсальный попап  -->
    <pop-up :content="popupContent" :popup-visible="popupVisible" @showPopup="hidePopup" :name="popupName"></pop-up>

    <main-section :anchor-name="pageAnchors[0]">
      <template v-slot:name>
        <section-name :centered="true">
          <template v-slot:name>
            Медицина и косметология 2.0
          </template>
          <template v-slot:slogan>
            КАЧЕСТВО ЖИЗНИ ИДЕТ РУКА ОБ РУКУ СО СТРЕМЛЕНИЕМ К СОВЕРШЕНСТВУ
          </template>

        </section-name>
      </template>
      <template v-slot:content>
        <collage></collage>
      </template>
    </main-section>

    <!--  МОЙ КАБИНЕТ  -->
    <main-section :anchor-name="pageAnchors[1]">

      <!--   SECTION NAME   -->
      <template v-slot:name>
        <section-name>
          Мой кабинет
        </section-name>
      </template>

      <!--   SECTION DESCRIPTION   -->
      <template v-slot:description>
        <section-desc>
          Маленькие ежедневные улучшения принесут, в конце концов, большие результаты
        </section-desc>
      </template>

      <!--   SECTION CONTENT   -->
      <template v-slot:content>
        <section-elements :items="serviceItems" @itemClicked="itemClicked" ></section-elements>
      </template>

    </main-section>

    <!--  КУРСЫ КОСМЕТОЛОГИИ  -->
    <main-section :anchor-name="pageAnchors[2]">

      <!--   SECTION NAME   -->
      <template v-slot:name>
        <section-name>
          Курсы косметологии
        </section-name>
      </template>

      <!--   SECTION CONTENT   -->
      <template v-slot:content>
        <section-elements :items="coursesItems" @itemClicked="itemClicked">
          <template v-slot:name>
            <section-name :small="true">Cестринское дело</section-name>
          </template>
          <template v-slot:desc>
            <section-desc :small="true">Описание курса сестринского дела</section-desc>
          </template>
        </section-elements>
        <section-elements :items="coursesItems" @itemClicked="itemClicked">
          <template v-slot:name>
            <section-name :small="true">Курс косметологии</section-name>
          </template>
          <template v-slot:desc>
            <section-desc :small="true">Описание курса косметологии</section-desc>
          </template>
        </section-elements>
      </template>

    </main-section>

    <main-section :anchor-name="pageAnchors[3]">
      <template v-slot:name>
        <section-name>
          Контакты
        </section-name>
      </template>
      <template v-slot:description>
        <section-desc>
          Вы можете связаться со мной одним из этих способов:
        </section-desc>
      </template>
      <template v-slot:content>
        <section-elements :items="contactsItems"></section-elements>
      </template>
    </main-section>
  </div>
</template>

<script>
import NavPanel from "@/components/UI/AdminNavigationPanel.vue";
import NavButton from "@/components/UI/NavigationButton.vue";
import MainSection from "@/components/pages/main/MainSection.vue";
import SectionName from "@/components/pages/main/SectionName.vue";
import SectionDesc from "@/components/pages/main/SectionDescription.vue";
import SectionElements from "@/components/pages/main/SectionElements.vue";
import PopUp from "@/components/UI/PopUp.vue";
import images from "@/imagesLoader";
import Collage from "@/components/pages/main/Collage.vue";

export default {
  components: {Collage, PopUp, SectionElements, SectionDesc, SectionName, MainSection, NavButton, NavPanel},
  data () {
    return{
      popupContent: '',
      popupName: '',
      popupVisible: false,
      serviceItems: [
        {
          name: 'УЛЬТРАЗВУКОВАЯ ЧИСТКА ЛИЦА',
          description:`<p><strong>ОПИСАНИЕ ПРОЦЕДУРЫ. ЭФФЕКТ ОТ ПРОЦЕДУРЫ</strong></p>
        <p><em> Глубокая очистка: </em> УЗ-чистка лица применяет ультразвуковые волны для удаления избытка кожного сала, загрязнений, омертвевших клеток кожи и других примесей из пор. Она позволяет более эффективно очистить кожу в сравнении с обычным очищением.</p>
        <p><em>Нежная и безопасная процедура:</em> УЗ-чистка лица не требует применения острых инструментов или механического давления на кожу. Это делает процедуру нежной и безболезненной, минимизируя риск повреждения кожи.</p>
        <p><em>Стимуляция кровообращения:</em> При использовании ультразвука процедура УЗ-чистки лица также стимулирует кровообращение и лимфодренаж, улучшая поставку кислорода и питательных веществ коже. Это может способствовать здоровому и свежему виду кожи.</p>
        <p><em>Минимизация пор:</em> Регулярное проведение УЗ-чистки лица может помочь уменьшить размер пор, так как процедура удалит избыток сала и примесей, которые могут расширять поры.</p>
        <p><em>Улучшение текстуры кожи:</em> УЗ-чистка лица помогает отшелушивать омертвевшие клетки кожи, способствуя регенерации и обновлению кожи. В результате кожа может стать более гладкой и мягкой.</p>
        <p>Важно отметить, что эффективность и результаты УЗ-чистки лица могут варьироваться в зависимости от индивидуальных особенностей кожи и профессионализма.</p>
        <p><strong>ПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
        <ul>
          <li>Угревая сыпь (кроме стадии обострения).</li>
          <li>Тусклый цвет лица.</li>
          <li>Пористость кожи.</li>
          <li>Ослабление тургора кожи.</li>
          <li>Расширенные загрязненные поры.</li>
          <li>Пониженный тонус кожи, кожа курильщика.</li>
          <li>Активная работа сальных желез.</li>
          <li>Жирность кожи.</li>
          <li>Комедоны.</li>
        </ul>
        <p><br><strong>ПРОТИВОПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
        <ul>
          <li>Экзема, активная стадия атопического дерматита и другие поражения кожи.</li>
          <li>Обострение герпетического процесса.</li>
          <li>Повышение температуры тела.</li>
          <li>Расширенные сосуды, сосудистый рисунок в области щек и вокруг носа.</li>
          <li>Повреждение кожи.</li>
          <li>Наличие в месте обработки «золотых нитей».</li>
          <li>Паралич лицевого нерва.</li>
          <li>Злокачественные новообразования.</li>
          <li>Эпилепсия.</li>
        </ul>
        <p><strong>КОЛИЧЕСТВО ПРОЦЕДУР И ВРЕМЯ, НЕОБХОДИМОЕ ДЛЯ ПРОВЕДЕНИЯ ПРОЦЕДУРЫ</strong></p>
        <p>Не реже одного раза в неделю при явных проблемах кожи или при посещении косметолога в постоянном режиме.</p>
        <p>Учитывая подготовку к очищению лица при помощи УЗ-скрабера, понадобится около 30 минут.</p>`,
          imageURL: 'http://cosmmedic.ru/resources/services/us_clean.jpg'
        },
        {
          name: 'МАНУАЛЬНЫЙ МАССАЖ ЛИЦА И ВОРОТНИКОВОЙ ЗОНЫ',
          description: `<p><strong>ОПИСАНИЕ ПРОЦЕДУРЫ. ЭФФЕКТ ОТ ПРОЦЕДУРЫ</strong></p>
                    <p>Массаж лица</p>
                    <p>Косметический массаж помогает улучшить кровообращение, стимулировать мышцы лица, способствовать лимфодренажу и улучшить общую текстуру кожи. Различные техники массажа могут быть применены для достижения различных целей, включая уменьшение отечности, смягчение морщин и улучшение тонуса кожи.</p>
                    <p>Лимфодренажный массаж направлен на стимуляцию лимфатической системы, улучшение оттока лимфы и удаление токсинов из кожи. Он может быть особенно полезен при отечности, усталом виде кожи и покраснении.</p>
                    <p><strong>ПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <p><em>Улучшение кровообращения:</em> Массаж лица может помочь стимулировать кровоток кожи, что может улучшить оксигенацию и питание тканей. Массаж позволяет тусклой коже стать более здоровой и сияющей.</p>
                    <p><em>Снятие гипертонуса и расслабление:</em> Массаж лица может помочь снять напряжение и способствовать расслаблению мышц, что может улучшить общее состояние кожи и снизить стресс.</p>
                    <p><em>Снижение отечности:</em> Лимфодренажный массаж может помочь стимулировать лимфатическую систему, улучшить отток лишней жидкости и снизить отечность в области лица.</p>
                    <p><em>Улучшение тонуса кожи:</em> Массаж лица может способствовать повышению тонуса и упругости кожи, улучшать ее эластичность и предотвращать появление морщин.</p>
                    <p><em>Снятие застойных явлений в подкожной клетчатке:</em> Лимфодренажный массаж может помочь снять застои и удалить продукты обмена веществ из тканей, улучшить микроциркуляцию и увеличить детоксикацию кожи.</p>
                    <p><em>Улучшение общего состояния организма:</em> Снятие стресса и расслабление благотворно влияет на нервную систему и приводит к улучшению настроения, снятие субдепрессивных состояний, нормализует настроение и сон.</p>
                    <p>Однако, перед применением массажа лица или лимфодренажного массажа, рекомендуется проконсультироваться с профессиональным косметологом или массажистом. Они смогут оценить ваши индивидуальные особенности и состояние кожи, и предложить наиболее подходящий и безопасный метод массажа.</p>
                    <p><strong>ПРОТИВОПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <ul>
                        <li>Открытые раны или инфекции: Если на лице есть открытые раны, воспаления или инфекции, массаж может усугубить состояние кожи и привести к распространению инфекции.</li>
                        <li>Кожные заболевания: Некоторые кожные заболевания, такие как экзема, псориаз, акне или герпес, могут быть противопоказаниями к массажу лица, особенно если они находятся в обострении. Массаж может раздражать кожу и усугубить симптомы.</li>
                        <li>Опухоли или новообразования: Если у вас есть опухоли, новообразования или подозрение на их наличие на лице, в области шеи и зоны декольте, а также – заболевания молочных желез, массаж может быть противопоказан. В этом случае, необходимо обратиться к врачу <br>для диагностики и получения разрешения к проведению процедуры.</li>
                        <li>Кровотечения или склонность к ним: Массаж лица может повысить кровоток, что может быть нежелательным при наличии кровотечений или склонности к ним, таким как сосудистые нарушения или тромбофлебит. Относительным противопоказанием является первый и второй день менструального цикла.</li>
                        <li>Купероз: При наличии сосудистой сетки (расширение капилляров) на лице, массаж может усилить их видимость или привести к повреждению.</li>
                        <li>Индивидуальная чувствительность: У некоторых людей может быть повышенная чувствительность или аллергическая реакция на массажные масла, кремы или техники массажа. В таком случае, необходимо быть осторожным при применении массажа.</li>
                    </ul>
                    <p><strong>КОЛИЧЕСТВО ПРОЦЕДУР И ВРЕМЯ, НЕОБХОДИМОЕ ДЛЯ ПРОВЕДЕНИЯ ПРОЦЕДУРЫ</strong></p>
                    <p>Количество сеансов – не менее 10, каждый день или через день.</p>
                    <p>Не менее полутора часов.</p>`,
          imageURL: 'http://cosmmedic.ru/resources/services/massage.jpg'
        },
        {
          name: 'МЕХАНИЧЕСКАЯ ЧИСТКА ЛИЦА',
          description: `<p><strong>ОПИСАНИЕ ПРОЦЕДУРЫ. ЭФФЕКТ ОТ ПРОЦЕДУРЫ</strong></p>
                    <p>Это процедура, при которой косметолог с использованием рук проводит механическое извлечение комедонов (черных точек) и скопление кожного себума. Важно, чтобы эту процедуру выполнял профессионал, чтобы предотвратить возможные повреждения или инфекции.</p>
                    <p>Выполняется процедура в стерильных условиях и с помощью стерильного инструмента – петли, ложки Уно или шпателя. Возможно применение пики или инъекционной иглы.</p>
                    <p><strong>ПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <ul>
                        <li><em>Загрязнение пор:</em> Мануальная чистка лица может быть полезной при наличии избыточной секреции кожного сала, которая приводит к загрязнению пор. Она может помочь удалить остатки макияжа, загрязнения и поддерживать чистоту кожи.</li>
                        <li><em>Миллиумы и комедоны:</em> Мануальная чистка может использоваться для удаления миллиумов (мелких железистых подкожных образований) и комедонов (черных точек), которые могут появляться на поверхности кожи, особенно в области T-зоны (лоб, нос, подбородок).</li>
                        <li><em>Улучшение текстуры кожи:</em> Мануальная чистка, совмещенная с ультразвуковой чисткой, может помочь смягчить кожу, улучшить ее текстуру и придать ей сияющий вид. Она может способствовать удалению омертвевших клеток и стимулировать обновление клеток кожи.</li>
                        <li><em>Повышение проникновения косметических средств:</em> Чистая кожа после мануальной чистки лучше впитывает активные ингредиенты из косметических средств, усиливая их эффективность. Это особенно полезно, если вы используете лечебные или увлажняющие продукты. Обязательным условием будет являться отсутствие механических повреждений при механической чистки.</li>
                    </ul>
                    <p><strong>ПРОТИВОПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <ul>
                        <li><em>Активный герпес или опасность его возникновения:</em> При наличии активного герпеса или высокой вероятности его появления не рекомендуется проводить мануальную чистку лица, так как это может способствовать распространению инфекции.</li>
                        <li><em>Острый период воспалений при акне или воспаления кожи, связанные с паразитами кожи:</em> Мануальная чистка может усугубить состояние кожи при наличии острого воспаления при акне или других воспалительных процессов. В таких случаях лучше обратиться к врачу-дерматологу для <br>получения более подходящего лечения.</li>
                        <li><em>Кожные заболевания или повреждения:</em> При наличии кожных заболеваний, таких как экзема, псориаз, дерматит и других, а также при наличии повреждений кожи, открытых ран или ожогов, не рекомендуется проводить мануальную чистку лица. Это может вызвать раздражение, инфекцию или ухудшение состояния кожи.</li>
                        <li><em>Чувствительная кожа:</em> У людей с очень чувствительной или тонкой кожей мануальная чистка может вызвать раздражение, покраснение, сухость или дискомфорт. В таких случаях лучше выбрать более мягкие методы очищения кожи.</li>
                        <li><em>Лекарственные препараты или условия, которые усиливают чувствительность кожи:</em> Некоторые лекарственные препараты или состояния, такие как ретиноиды, могут делать кожу более чувствительной и уязвимой. Мануальную чистку лица лучше отложить при таких обстоятельствах <br>до периода окончания лечения препаратами.</li>
                    </ul>
                    <p>Важно консультироваться с квалифицированным специалистом, таким как косметолог или дерматолог, чтобы они могли оценить состояние вашей кожи и дать рекомендации относительно&nbsp;проведения мануальной чистки лица.</p>
                    <p>Не делайте механическую чистку самостоятельно, это может значительно ухудшить состояние кожи, так как возможно присоединение вторичной инфекции.</p>
                    <p><strong>КОЛИЧЕСТВО ПРОЦЕДУР И ВРЕМЯ, НЕОБХОДИМОЕ ДЛЯ ПРОВЕДЕНИЯ ПРОЦЕДУРЫ</strong></p>
                    <p>Механическая чистка лица проводится по мере загрязнения пор, либо, один раз в месяц.</p>
                    <p>Регулярно.</p>
                    <p>Время: не менее двух часов на полную процедуру.</p>
                    <p>Механическая чистка включает:</p>
                    <ul>
                        <li>процедуру прохладного гидрирования.</li>
                        <li>непосредственно механическая чистка длится не более 20-30 минут</li>
                        <li>несколько масок (поросуживающая и регенерирующая) около 35-40 минут.</li>
                    </ul>`,
          imageURL: 'http://cosmmedic.ru/resources/services/mechanical.jpg'
        },
        {
          name: 'МЕЗОТЕРАПИЯ ОБЛАСТИ ЛИЦА, ОРБИТЫ, ВОЛОСИСТОЙ ЧАСТИ ГОЛОВЫ',
          description: `<p><strong>ОПИСАНИЕ ПРОЦЕДУРЫ. ЭФФЕКТ ОТ ПРОЦЕДУРЫ</strong></p>
                    <p>Мезотерапия - это процедура косметологии, при которой введение специальных коктейлей с активными веществами осуществляется в мезодермальный слой кожи (средний слой). Эта техника широко применяется для улучшения состояния кожи и решения различных эстетических проблем.</p>
                    <p>Мезотерапия может помочь улучшить текстуру кожи, устранить пигментацию, выровнять цвет лица и снизить появление морщин и мелких линий.</p>
                    <p>Процедура способна увлажнять кожу, повышая уровень гиалуроновой кислоты и других увлажняющих веществ.</p>
                    <p>Мезотерапия может помочь справиться с проблемой акне, уменьшить воспаление, а также разгладить пигментацию и следы от пост-акне.</p>
                    <p><strong>Процедура мезотерапии направлена на:</strong></p>
                    <ul>
                        <li><em>Увлажнение кожи:</em> Мезотерапия помогает улучшить уровень гидратации кожи. Путем введения специальных коктейлей или сывороток, содержащих гиалуроновую кислоту и другие увлажняющие компоненты, происходит интенсивное увлажнение кожи, проникновение влаги в глубокие слои и удержание ее там.</li>
                        <li><em>Регенерация и стимуляция коллагена:</em> Процедура мезотерапии может способствовать стимуляции синтеза коллагена, основного структурного белка кожи. Это помогает улучшить упругость и тонус кожи, сокращает морщины и признаки старения.</li>
                        <li><em>Лечение проблемной кожи:</em> Мезотерапия может быть использована для лечения проблемной кожи, такой как акне или гиперпигментация. Специальные препараты, содержащиеся в мезококтейлях, могут помочь снизить воспаление и улучшить текстуру кожи.</li>
                        <li><em>Снижение пигментации:</em> При наличии гиперпигментации или пятен на коже, мезотерапия может помочь уменьшить их видимость. Активные ингредиенты, содержащиеся в мезококтейлях, могут воздействовать на пигментные клетки и способствовать выравниванию тона кожи.</li>
                        <li><em>Укрепление волос:</em> Мезотерапия может быть также применена для лечения выпадения волос. Введение специальных препаратов стимулирует волосяные фолликулы, способствуя росту здоровых и крепких волос.</li>
                    </ul>
                    <p><strong>Мезотерапия также может применяться в области орбиты (глазной впадины) для решения </strong><br><strong>определенных проблем и улучшения внешнего вида этой области:</strong></p>
                    <ul>
                        <li><em>Устранение темных кругов под глазами:</em> Мезотерапия может помочь снизить видимость темных кругов под глазами путем стимуляции микроциркуляции, улучшения дренажа и осветления пигментации.</li>
                        <li><em>Снятие отечности вокруг глаз:</em> Процедура может помочь уменьшить отечность и заметность мешков под глазами, улучшая лимфодренаж и восстанавливая тонус и упругость кожи.</li>
                        <li><em>Увлажнение и питание кожи вокруг глаз:</em> Мезотерапия может использоваться для увлажнения и питания кожи в области орбиты, что поможет сделать ее более гладкой и упругой.</li>
                        <li><em>Уменьшение морщин и мелких линий:</em> Процедура может помочь разгладить морщины и мелкие линии вокруг глаз, улучшая тонус и эластичность кожи</li>
                    </ul>
                    <p>Важно отметить, что эффективность и результаты мезотерапии могут варьироваться в зависимости от индивидуальных особенностей кожи и проблемы, которую требуется решить. Лучше всего обсудить возможность проведения данной процедуры со своим косметологом или дерматологом, чтобы получить рекомендации, основанные на вашем конкретном случае.</p>
                    <p><strong>ПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <p>Прежде чем приступить к мезотерапии лица, области орбит или волосистой части головы, необходимо проконсультироваться с квалифицированным врачом-косметологом. Они смогут оценить состояние вашей кожи, провести анализ и дать рекомендации по применению <br>процедуры.</p>
                    <p>Показания для мезотерапии лица могут включать:</p>
                    <ul>
                        <li>Сухая, увядающая или поврежденная кожа</li>
                        <li>Мелкие морщины и линии</li>
                        <li>Пигментация и пигментные пятна</li>
                        <li>Неровный тон и текстура кожи</li>
                        <li>Угревая сыпь и следы постакне</li>
                    </ul>
                    <p>Процедура мезотерапии лица включает введение специально разработанного раствора с помощью тонких игл в средний или глубокий слой кожи лица. Этот раствор может содержать витамины, минералы, антиоксиданты и другие полезные компоненты, которые способствуют улучшению состояния и внешнего вида кожи.</p>
                    <p><strong>ПРОТИВОПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <ul>
                        <li>Заболевания кожи различной этиологии;</li>
                        <li>Хроническая почечная недостаточность;</li>
                        <li>Нефропатия;</li>
                        <li>Хроническая сосудистая патология;</li>
                        <li>Беременность;</li>
                        <li>Желчнокаменная болезнь;</li>
                        <li>Острая лихорадка;</li>
                        <li>Нарушение свертываемости крови – либо при заболевании, либо из-за приема антикоагулянтов.</li>
                    </ul>
                    <p><strong>КОЛИЧЕСТВО ПРОЦЕДУР И ВРЕМЯ, НЕОБХОДИМОЕ ДЛЯ ПРОВЕДЕНИЯ ПРОЦЕДУРЫ</strong></p>
                    <p>Результаты мезотерапии могут быть видны через несколько сеансов. Рекомендуется проводить не менее 4-х процедур с интервалами от 4 до 7 дней для достижения желаемых результатов.</p>
                    <p>Время на одну процедуру может занимать от 25 минут до полутора часов.</p>`,
          imageURL: 'http://cosmmedic.ru/resources/services/meso.jpg'
        },
        {
          name: 'БИОРЕВИТАЛИЗАЦИЯ ОБЛАСТИ ЛИЦА, ШЕИ И ЗОНЫ ДЕКОЛЬТЕ',
          description: `<p><strong>ОПИСАНИЕ ПРОЦЕДУРЫ. ЭФФЕКТ ОТ ПРОЦЕДУРЫ</strong></p>
                    <p>Преимущества процедуры биоревитализации по сравнению с мезотерапией:</p>
                    <p><em>Глубинное увлажнение:</em> Биоревитализация использует специальные гидрофильные гелевые препараты на основе гиалуроновой кислоты, которые обладают способностью удерживать влагу в коже на длительный срок. Это позволяет достичь более глубокого и продолжительного <br>увлажнения кожи, чем при обычной мезотерапии.</p>
                    <p><em>Стимуляция коллагена:</em> Биоревитализация также способствует стимуляции синтеза коллагена и эластина в коже. Гидрофильные гелевые препараты содержат активные ингредиенты, которые помогают улучшить структуру и упругость кожи, а также снизить видимость морщин.</p>
                    <p><em>Более комфортная процедура:</em> Биоревитализация обычно проводится с использованием тонкой иглы, что делает процедуру комфортной для пациента. Гидрофильные гелевые препараты также могут содержать обезболивающие компоненты, снижающие болевые ощущения во время введения.</p>
                    <p>Важно отметить, что эффективность и предпочтительность определенной процедуры могут различаться в зависимости от индивидуальных потребностей и характеристик кожи. Консультация с профессиональным косметологом или дерматологом поможет определить наиболее подходящий вариант для вашей конкретной ситуации.</p>
                    <p><strong>ПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <ul>
                        <li>Ранняя профилактика процессов старения;</li>
                        <li>Сухая кожа со сниженным тонусом и упругостью мышц;</li>
                        <li>Мелкие морщинки в области лица и декольте, носогубные складки;</li>
                        <li>Темные круги под глазами;</li>
                        <li>Неровный рельеф кожи;</li>
                        <li>Расширенные поры на лице;</li>
                        <li>Пятна постакне;</li>
                    </ul>
                    <p><strong>ПРОТИВОПОКАЗАНИЯ К ПРОВЕДЕНИЮ ПРОЦЕДУРЫ</strong></p>
                    <ul>
                        <li>Аллергическая реакция или индивидуальная непереносимость гиалуроновой кислоты;</li>
                        <li>Период вынашивания ребенка и грудного вскармливания;</li>
                        <li>Болезни аутоиммунного спектра, когда в организме вырабатывается огромное количество антител к его собственным клеткам, и гиалуроновая кислота будет восприниматься как чужеродный агент;</li>
                        <li>Онкология, распространению которой на большие площади может посодействовать гиалуроновая кислота;</li>
                        <li>Общее недомогание с обострением хронических заболеваний и повышением температуры;</li>
                        <li>Келоидные рубцы и гипертрофия тканей;</li>
                        <li>Сахарный диабет;</li>
                        <li>Психические расстройства;</li>
                        <li>Нарушение свертываемости крови;</li>
                        <li>Прием антикоагулянтов;</li>
                    </ul>
                    <p><strong>КОЛИЧЕСТВО ПРОЦЕДУР И ВРЕМЯ, НЕОБХОДИМОЕ ДЛЯ ПРОВЕДЕНИЯ ПРОЦЕДУРЫ</strong></p>
                    <p>В отличие от мезотерапии, которая требует, часто, серии процедур (от 4 до 8) для достижения желаемых результатов, биоревитализация может давать заметные результаты уже после 2-3 сеансов. Обычно рекомендуется проводить 3-4 процедуры с интервалом в 2 недели для достижения оптимального эффекта.</p>
                    <p>На каждую процедуру может быть потрачено от 25 минут до полутора часов.</p>`,
          imageURL: 'http://cosmmedic.ru/resources/services/young.jpg'
        },
      ],
      coursesItems: [
        {
          name: 'Уз чистка лица',
          description: undefined,
          imageURL: 'http://cosmmedic.ru/resources/services/us_clean.jpg'
        },
        {
          name: 'Массаж',
          description: undefined,
          imageURL: 'http://cosmmedic.ru/resources/services/massage.jpg'
        },
        {
          name: 'Чистка',
          description: undefined,
          imageURL: 'http://cosmmedic.ru/resources/services/mechanical.jpg'
        },
        {
          name: 'Мезотерапия',
          description: undefined,
          imageURL: 'http://cosmmedic.ru/resources/services/meso.jpg'
        },
        {
          name: 'Биоревитализация',
          description: undefined,
          imageURL: 'http://cosmmedic.ru/resources/services/young.jpg'
        },
      ],
      contactsItems: [
        {
          name: 'VK',
          description: undefined,
          imageURL: images["vk_icon"],
          contactItem: true,
          locationURL: 'https://vk.com/im?sel=189596649'
        },
        {
          name: 'Telegram',
          description: undefined,
          imageURL: images["tg_icon"],
          contactItem: true,
          locationURL: 'https://t.me/HelenaFreedom'
        },
        {
          name: 'WhatsApp',
          description: undefined,
          imageURL: images["whatsapp_icon"],
          contactItem: true,
          locationURL: 'https://wa.me/+79956499610?text=%D0%97%D0%B4%D1%80%D0%B0%D0%B2%D1%81%D1%82%D0%B2%D1%83%D0%B9%D1%82%D0%B5,%20'
        }
      ],
      pageAnchors: [
        {
          id: 0,
          link: 'home',
          displayName: 'Домой'
        },
        {
          id: 1,
          link: 'cabinet',
          displayName: 'Кабинет'
        },
        {
          id: 2,
          link: 'courses',
          displayName: 'Курсы'
        },
        {
          id: 3,
          link: 'contacts',
          displayName: 'Контакты'
        }
      ]
    }
  },
  methods: {
    itemClicked (eventArg1, eventArg2) {
      this.popupName = eventArg1;
      this.popupContent = eventArg2;
      this.popupVisible = true;
    },
    hidePopup () {
      this.popupVisible = false;
    }
  },
  mounted() {
      this.$emit('updatePageAnchors', this.pageAnchors)
  }

}
</script>

<style scoped>
* {
  background-color: var(--comm-color-secondary);
}
</style>