<template>
  <div class="container grid mt-4">
    <div class="row">
      <div class="col-md-6 col-lg-5 col-xl-4 col-xxl-3 d-flex align-items-center">
        <img class="img-fluid rounded rounded-circle shadow" src="../../../resources/persons/elus.png" alt="">
      </div>
      <div class="col-md-6 col-lg-7 col-xl-8 col-xxl-9 fs-5 p-3 ">
        <p class="text-light-emphasis">Быть успешным косметологом требует страсти к работе, непрерывного обучения и мастерства в
          применении различных методик и техник красоты и здоровья кожи. Для меня моя работа – это
          моя жизнь и любовь. Видеть результат, удовлетворяющий потребности клиента, видеть счастье и
          радость в глазах человека, доверившего мне самое дорогое – себя, вот та награда, которой я
          всегда рада!</p>
        <p class="text-light-emphasis">Косметология сочетает в себе элементы красоты и медицины. Основная цель косметолога -
          помочь людям улучшить свою внешность и здоровье кожи. Это требует знания анатомии,
          физиологии и медицины. Помочь поверить в себя, научить любить себя. Вот моя цель при работе
          с клиентами любых возрастов и потребностей.</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {

}
</script>